## ■ SNS의 글로 같은 성향을 가진 사람들을 분류하기 전에 필수로 알아야 되는 R 함수
    결측치가 많아서 다른 값으로 치환하는 코드 작성이 필요
        이상치/ 결측치 확인
    
    결측치를 대체하는 방법 3가지
        1. 최빈값으로 치환 - hot deck
        2. 평균값으로 치환 - mean imputation
        3. 회귀 추정값으로 치환  - regression imputation

### ※ 문제286. ave함수를 이용해서 자기가 속한 부서번호의 평균월급을 avgsal이라는 파생변수에 담은 후 이름, 월급, 부서번호, 부서번호 별 평균월급 출력하시오
```sql
select ename, sal, deptno, avg(sal) over (partition by deptno) as avgsal
    from emp
```

In [2]:
emp <- read.csv("emp3.csv", header=T)
attach(emp)
emp$avgsal <- ave(sal, deptno, FUN=function(x) mean(x))
emp[ , c("ename","sal","deptno","avgsal")]

The following object is masked _by_ .GlobalEnv:

    index

The following objects are masked from emp (pos = 3):

    comm, deptno, empno, ename, hiredate, index, job, mgr, sal

   ename  sal  deptno avgsal
1  KING   5000 10     2916.667
2  BLAKE  2850 30     1566.667
3  CLARK  2450 10     2916.667
4  JONES  2975 20     2175.000
5  MARTIN 1250 30     1566.667
6  ALLEN  1600 30     1566.667
7  TURNER 1500 30     1566.667
8  JAMES   950 30     1566.667
9  WARD   1250 30     1566.667
10 FORD   3000 20     2175.000
11 SMITH   800 20     2175.000
12 SCOTT  3000 20     2175.000
13 ADAMS  1100 20     2175.000
14 MILLER 1300 10     2916.667

In [ ]:
ave(1:3)

### ※ 문제287. 이름, 월급, 직업, 자기가 속한 직업의 평균월급을 출력

In [3]:
emp <- read.csv('emp3.csv',head=T)
emp$jobsal <- ave(sal, job, FUN=function(x) mean(x))
emp

   index empno ename  job       mgr  hiredate        sal  comm deptno jobsal
1   1    7839  KING   PRESIDENT   NA 1981-11-17 0:00 5000   NA 10     5000.000
2   2    7698  BLAKE  MANAGER   7839 1981-05-01 0:00 2850   NA 30     2758.333
3   3    7782  CLARK  MANAGER   7839 1981-05-09 0:00 2450   NA 10     2758.333
4   4    7566  JONES  MANAGER   7839 1981-04-01 0:00 2975   NA 20     2758.333
5   5    7654  MARTIN SALESMAN  7698 1981-09-10 0:00 1250 1400 30     1400.000
6   6    7499  ALLEN  SALESMAN  7698 1981-02-11 0:00 1600  300 30     1400.000
7   7    7844  TURNER SALESMAN  7698 1981-08-21 0:00 1500    0 30     1400.000
8   8    7900  JAMES  CLERK     7698 1981-12-11 0:00  950   NA 30     1037.500
9   9    7521  WARD   SALESMAN  7698 1981-02-23 0:00 1250  500 30     1400.000
10 10    7902  FORD   ANALYST   7566 1981-12-11 0:00 3000   NA 20     3000.000
11 11    7369  SMITH  CLERK     7902 1980-12-09 0:00  800   NA 20     1037.500
12 12    7788  SCOTT  ANALYST   7566 1982-12-22 0:00 3000   NA 20     3000.000
13 13    7876  ADAMS  CLERK     7788 1983-01-15 0:00 1100   NA 20     1037.500
14 14    7934  MILLER CLERK     7782 1982-01-11 0:00 1300   NA 10     1037.500

### ※ 문제288. 사원 테이블에 결측치가 얼마나 있는지 확인하시오

In [4]:
colSums(is.na(emp))

   index    empno    ename      job      mgr hiredate      sal     comm
       0        0        0        0        1        0        0       10
  deptno   jobsal
       0        0

### ※ 문제289. 사원 테이블의 커미션의 결측치를 자기가 속한 부서번호의 평균월급으로 치환하시오

In [9]:
emp$comm[is.na(emp$comm)] <- ave(emp$sal, emp$deptno, FUN=function(x) mean(x))

Warning message in emp$comm[is.na(emp$comm)] <- ave(emp$sal, emp$deptno, FUN = function(x) mean(x)):
"number of items to replace is not a multiple of replacement length"